package com.ohgiraffers.practice.demensinal_array;

public class Application3 {

    public static void main(String[] args) {

        /* 1. 길이 12의 문자열 배열 생성
         * 2. 12명의 학생들을 출석부 순으로 1차원 배열에 할당
         * 3. 2열 3행 2차원 배열을 2개 할당
         * 4. 각 1분단, 2분단으로 지정
         * 5. 순차적으로  1분단부터, 왼쪽부터 오른쪽, 1행에서 아래 행으로 번호 순으로 자리를 배치하고 출력하세요.
         *
         * -- 출석부 --
         * 1. 안유진
         * 2. 장원영
         * 3. 사쿠라
         * 4. 김채원
         * 5. 전소연
         * 6. 민니
         * 7. 고민시
         * 8. 설인아
         * 9. 김태리
         * 10. 신세경
         * 11. 한소희
         * 12. 천우희
         *
         * -- 출력 예시 --
         * == 1분단 ==
         * 안유진 장원영
         * 사쿠라 김채원
         * 전소연 민니
         *
         * == 2분단 ==
         * 고민시 설인아
         * 김태리 신세경
         * 한소희 천우희
         */

    }

}
